tests/resources/invoice.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:fu="http://www.fu.gov.si/" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Header />
<soapenv:Body>
<fu:InvoiceRequest Id="data">
<fu:Header>
<fu:MessageID>4e64a93a-40fa-4c02-afb1-488534b85e4c</fu:MessageID>
<fu:DateTime>2015-08-07T13:05:24</fu:DateTime>
</fu:Header>
<fu:Invoice>
<fu:TaxNumber>10039953</fu:TaxNumber>
<fu:IssueDateTime>2015-08-07T13:05:24</fu:IssueDateTime>
<fu:NumberingStructure>B</fu:NumberingStructure>
<fu:InvoiceIdentifier>
<fu:BusinessPremiseID>AABB</fu:BusinessPremiseID>
<fu:ElectronicDeviceID>BLAG2</fu:ElectronicDeviceID>
<fu:InvoiceNumber>145</fu:InvoiceNumber>
</fu:InvoiceIdentifier>
<fu:InvoiceAmount>66.71</fu:InvoiceAmount>
<fu:PaymentAmount>1047.76</fu:PaymentAmount>
<fu:TaxesPerSeller>
<fu:VAT>
<fu:TaxRate>22.00</fu:TaxRate>
<fu:TaxableAmount>23.14</fu:TaxableAmount>
<fu:TaxAmount>5.09</fu:TaxAmount>
</fu:VAT>
<fu:VAT>
<fu:TaxRate>9.50</fu:TaxRate>
<fu:TaxableAmount>35.14</fu:TaxableAmount>
<fu:TaxAmount>3.34</fu:TaxAmount>
</fu:VAT>
</fu:TaxesPerSeller>
<fu:OperatorTaxNumber>10039953</fu:OperatorTaxNumber>
<fu:ProtectedID>34905bcff14b381039af2e9d7eee54bb</fu:ProtectedID>
</fu:Invoice>
</fu:InvoiceRequest>
</soapenv:Body>
</soapenv:Envelope>